ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/deprecated/cs.c
        }
    }

    return (CLKFrequency);
}

//*****************************************************************************
//
//! \brief Compute the clock frequency given the clock source and divider
//!
//! \param baseAddress is the base address of the CS module.
//! \param CLKSource
//! \param CLKSourceDivider
//!        Valid values are:
//!        - \b CS_CLOCK_DIVIDER_1 - [Default for ACLK]
//!        - \b CS_CLOCK_DIVIDER_2
//!        - \b CS_CLOCK_DIVIDER_4
//!        - \b CS_CLOCK_DIVIDER_8 - [Default for SMCLK and MCLK]
//!        - \b CS_CLOCK_DIVIDER_16
//!        - \b CS_CLOCK_DIVIDER_32
//!
//! \return Calculated clock frequency in Hz
//
//*****************************************************************************
static uint32_t privateCSComputeCLKFrequency ( uint16_t baseAddress,
    uint16_t CLKSource,
    uint16_t CLKSourceDivider
    )
{
    uint32_t CLKFrequency;
    uint8_t CLKSourceFrequencyDivider = 1;
    uint8_t i = 0;

    // Determine Frequency divider
    for ( i = 0; i < CLKSourceDivider; i++){
        CLKSourceFrequencyDivider *= 2;
    }

    //Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    // Determine clock source based on CLKSource
    switch (CLKSource){

        // If XT1 is selected as clock source
        case SELM__XT1CLK:
            CLKFrequency = (CS_XT1ClockFrequency /
                            CLKSourceFrequencyDivider);

            //Check if XT1OFFG is not set. If fault flag is set
            //VLO is used as source clock
            if (HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG){
                HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG){
                    CLKFrequency = CS_VLOCLK_FREQUENCY;
                }
            }
            break;

        case SELM__VLOCLK:
            CLKFrequency =
                (CS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;

        case SELM__DCOCLK:
            CLKFrequency =
            privateCSSourceClockFromDCO(baseAddress, CLKSourceFrequencyDivider);

            break;

        case SELM__XT2CLK:
            CLKFrequency =
                (CS_XT2ClockFrequency / CLKSourceFrequencyDivider);

            if (HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG){

              HWREG8(baseAddress + OFS_CSCTL5) &=  ~XT2OFFG;
              //Clear OFIFG fault flag
              HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
            }

            if (HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG){
                CLKFrequency = CS_MODCLK_FREQUENCY;
            }
            break;
    }

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

    return (CLKFrequency) ;
}

//*****************************************************************************
//
//! \brief Sets the external clock source
//!
//! This function sets the external clock sources XT1 and XT2 crystal
//! oscillator frequency values. This function must be called if an external
//! crystal XT1 or XT2 is used and the user intends to call CS_getMCLK,
//! CS_getSMCLK, CS_getACLK and XT1Start, XT1ByPass, XT1StartWithTimeout,
//! XT1ByPassWithTimeout.
//!
//! \param baseAddress is the base address of the CS module.
//! \param XT1CLK_frequency is the XT1 crystal frequencies in Hz
//! \param XT2CLK_frequency is the XT2 crystal frequencies in Hz
//!
//! \return None
//
//*****************************************************************************
void CS_setExternalClockSource (uint16_t baseAddress,
    uint32_t XT1CLK_frequency,
    uint32_t XT2CLK_frequency
    )
{
    CS_XT1ClockFrequency = XT1CLK_frequency;
    CS_XT2ClockFrequency = XT2CLK_frequency;
}

//*****************************************************************************
//
//! \brief Initializes clock signal
//!
//! This function initializes each of the clock signals. The user must ensure
//! that this function is called for each clock signal. If not, the default
//! state is assumed for the particular clock signal. Refer to MSP430ware
//! documentation for CS module or Device Family User's Guide for details of
//! default clock signal states.
//!
//! \param baseAddress is the base address of the CS module.
//! \param selectedClockSignal is the selected clock signal
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//! \param clockSource is Clock source for the selectedClock
//!        Valid values are:
//!        - \b CS_XT1CLK_SELECT
//!        - \b CS_VLOCLK_SELECT
//!        - \b CS_DCOCLK_SELECT
//!        - \b CS_XT2CLK_SELECT
//! \param clockSourceDivider selects the clock divider to calculate clock
//!        signal from clock source.
//!        Valid values are:
//!        - \b CS_CLOCK_DIVIDER_1 - [Default for ACLK]
//!        - \b CS_CLOCK_DIVIDER_2
//!        - \b CS_CLOCK_DIVIDER_4
//!        - \b CS_CLOCK_DIVIDER_8 - [Default for SMCLK and MCLK]
//!        - \b CS_CLOCK_DIVIDER_16
//!        - \b CS_CLOCK_DIVIDER_32
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL3 register and bits of
//! \b CSCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void CS_clockSignalInit ( uint16_t baseAddress,
    uint8_t selectedClockSignal,
    uint16_t clockSource,
    uint16_t clockSourceDivider
    )
{

	//Verify User has selected a valid Frequency divider
	assert(
		(CS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
		(CS_CLOCK_DIVIDER_32 == clockSourceDivider)
		);

