ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/deprecated/cs.c
	// Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	switch (selectedClockSignal){
		case CS_ACLK:
			//verify User has selected a valid clock source for ACLK
			assert(
					(CS_XT1CLK_SELECT == clockSource) ||
					(CS_VLOCLK_SELECT == clockSource) ||
					(CS_DCOCLK_SELECT == clockSource) ||
					(CS_XT2CLK_SELECT == clockSource)
					);
			clockSourceDivider = clockSourceDivider << 8;
			clockSource = clockSource << 8;

			HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELA_7);
			HWREG16(baseAddress + OFS_CSCTL2) |= (clockSource);
			HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVA0 + DIVA1 + DIVA2);
			HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
			break;
		case CS_SMCLK:
			assert(
				(CS_XT1CLK_SELECT == clockSource) ||
				(CS_VLOCLK_SELECT == clockSource) ||
				(CS_DCOCLK_SELECT == clockSource) ||
				(CS_XT2CLK_SELECT == clockSource)
				);

			clockSource = clockSource << 4;
			clockSourceDivider = clockSourceDivider << 4;

			HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELS_7);
			HWREG16(baseAddress + OFS_CSCTL2) |= clockSource;
			HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVS0 + DIVS1 + DIVS2);
			HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
			break;
		case CS_MCLK:
			assert(
			(CS_XT1CLK_SELECT == clockSource) ||
			(CS_VLOCLK_SELECT == clockSource) ||
			(CS_DCOCLK_SELECT == clockSource) ||
			(CS_XT2CLK_SELECT == clockSource)
			);

			HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELM_7);
			HWREG16(baseAddress + OFS_CSCTL2) |= clockSource;
			HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVM0 + DIVM1 + DIVM2);
			HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
			break;
	}

	// Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Initializes the XT1 crystal oscillator in low frequency mode.
//!
//! Loops until all oscillator fault flags are cleared, with no timeout. See
//! the device-specific data sheet for appropriate drive settings. IMPORTANT:
//! User must call CS_setExternalClockSource function to set frequency of
//! external clocks before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param xt1drive is the target drive strength for the XT1 crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_XT1DRIVE_0
//!        - \b CS_XT1DRIVE_1
//!        - \b CS_XT1DRIVE_2
//!        - \b CS_XT1DRIVE_3 [Default]
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG1 register.
//!
//! \return None
//
//*****************************************************************************
void CS_XT1Start ( uint16_t baseAddress,
    uint16_t xt1drive
    )
{
	assert(CS_XT1ClockFrequency !=0);

    assert((xt1drive == CS_XT1_DRIVE0 ) ||
        (xt1drive == CS_XT1_DRIVE1 ) ||
        (xt1drive == CS_XT1_DRIVE2 ) ||
        (xt1drive == CS_XT1_DRIVE3 ));

	// Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    //If the drive setting is not already set to maximum
    //Set it to max for LFXT startup
    if ((HWREG16(baseAddress + OFS_CSCTL4) & XT1DRIVE_3) != XT1DRIVE_3){
        //Highest drive setting for XT1startup
        HWREG16(baseAddress + OFS_CSCTL4_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
    }

	//If user is using XT1 in HF mode
	if(CS_XT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		HWREG16(baseAddress + OFS_CSCTL4) |= XTS;
		HWREG16(baseAddress + OFS_CSCTL4) &= ~XT1BYPASS;
	}else{
		HWREG16(baseAddress + OFS_CSCTL4) &= ~(XTS+XT1BYPASS);
	}

    //Wait for Crystal to stabilize
    while (HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //set requested Drive mode
    HWREG16(baseAddress + OFS_CSCTL4) = ( HWREG16(baseAddress + OFS_CSCTL4) &
                                         ~(XT1DRIVE_3)
                                         ) |
                                       (xt1drive);

    //Switch ON XT1 oscillator
    HWREG16(baseAddress + OFS_CSCTL4) &= ~XT1OFF;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Bypasses the XT1 crystal oscillator.
//!
//! Loops until all oscillator fault flags are cleared, with no timeout.
//! IMPORTANT: User must call CS_setExternalClockSource function to set
//! frequency of external clocks before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG register.
//!
//! \return None
//
//*****************************************************************************
void CS_bypassXT1 ( uint16_t baseAddress)
{
	//Verify user has set frequency of XT1 with SetExternalClockSource
	assert(CS_XT1ClockFrequency!=0);

	// Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	if(CS_XT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		// Set XT1 in HF mode switch off XT1 Oscillator and enable BYPASS mode
		HWREG16(baseAddress + OFS_CSCTL4) |= (XTS + XT1BYPASS +XT1OFF);
	}else {
		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
		HWREG16(baseAddress + OFS_CSCTL4) &= ~XTS;
		HWREG16(baseAddress + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);
	}

		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
	HWREG16(baseAddress + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);

	//Wait until XT1 stabilizes
	while (HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG)
	{
		//Clear OSC flaut Flags fault flags
		HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
	}
	// Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes the XT1 crystal oscillator in low frequency mode with
//! timeout.
//!
//! Loops until all oscillator fault flags are cleared or until a timeout
//! counter is decremented and equals to zero. See the device-specific
//! datasheet for appropriate drive settings. IMPORTANT: User must call
//! CS_setExternalClockSource function to set frequency of external clocks
//! before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param xt1drive is the target drive strength for the XT1 crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_XT1DRIVE_0
//!        - \b CS_XT1DRIVE_1
//!        - \b CS_XT1DRIVE_2
//!        - \b CS_XT1DRIVE_3 [Default]
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_XT1StartWithTimeout (uint16_t baseAddress,
    uint16_t xt1drive,
    uint32_t timeout
    )
{
	assert(CS_XT1ClockFrequency !=0);

