ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/deprecated/cs.c
	assert((xt1drive == CS_XT1_DRIVE0 ) ||
		(xt1drive == CS_XT1_DRIVE1 ) ||
		(xt1drive == CS_XT1_DRIVE2 ) ||
		(xt1drive == CS_XT1_DRIVE3 ));

    assert(timeout > 0);

	// Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	//If the drive setting is not already set to maximum
	//Set it to max for LFXT startup
	if ((HWREG16(baseAddress + OFS_CSCTL4) & XT1DRIVE_3) != XT1DRIVE_3){
		//Highest drive setting for XT1startup
		HWREG16(baseAddress + OFS_CSCTL4_L) |= XT1DRIVE1_L + XT1DRIVE0_L;
	}

	//If user is using XT1 in HF mode
	if(CS_XT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		HWREG16(baseAddress + OFS_CSCTL4) |= XTS;
		HWREG16(baseAddress + OFS_CSCTL4) &= ~XT1BYPASS;
	}else{
	//If user is using XT1 in HF mode
		HWREG16(baseAddress + OFS_CSCTL4) &= ~(XTS+XT1BYPASS);
	}

	while ((HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

	if(timeout){

	    //set requested Drive mode
		HWREG16(baseAddress + OFS_CSCTL4) = ( HWREG16(baseAddress + OFS_CSCTL4) &
												 ~(XT1DRIVE_3)
												 ) |
											   (xt1drive);
		//Switch ON XT1 oscillator
		HWREG16(baseAddress + OFS_CSCTL4) &= ~XT1OFF;
		// Lock CS control register
		HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
		return (STATUS_SUCCESS);
	} else   {
		// Lock CS control register
		HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
		return (STATUS_FAIL);
	}
}

//*****************************************************************************
//
//! \brief Bypasses the XT1 crystal oscillator with timeout.
//!
//! Loops until all oscillator fault flags are cleared or until a timeout
//! counter is decremented and equals to zero.IMPORTANT: User must call
//! CS_setExternalClockSource to set frequency of external clocks before
//! calling this function
//!
//! \param baseAddress is the base address of the CS module.
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_bypassXT1WithTimeout (uint16_t baseAddress,
    uint32_t timeout
    )
{
    assert(CS_XT1ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	if(CS_XT1ClockFrequency>XT1_FREQUENCY_THRESHOLD){
		// Set XT1 in HF mode switch off XT1 Oscillator and enable BYPASS mode
		HWREG16(baseAddress + OFS_CSCTL4) |= (XTS + XT1BYPASS +XT1OFF);
	}else {
		// Set XT1 in LF mode Switch off XT1 oscillator and enable BYPASS mode
		HWREG16(baseAddress + OFS_CSCTL4) &= ~XTS;
		HWREG16(baseAddress + OFS_CSCTL4) |= (XT1BYPASS + XT1OFF);
	}

	while ((HWREG8(baseAddress + OFS_CSCTL5) & XT1OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

	// Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

    if (timeout){
        return (STATUS_SUCCESS);
    } else {
        return (STATUS_FAIL);
    }
}

//*****************************************************************************
//
//! \brief Stops the XT1 oscillator using the XT1OFF bit.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL4 register.
//!
//! \return None
//
//*****************************************************************************
void CS_XT1Off (uint16_t baseAddress)
{
	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;
    //Switch off XT1 oscillator
    HWREG16(baseAddress + OFS_CSCTL4) |= XT1OFF;
    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Starts the XT2 crystal
//!
//! Initializes the XT2 crystal oscillator, which supports crystal frequencies
//! between 4 MHz and 32 MHz, depending on the selected drive strength. Loops
//! until all oscillator fault flags are cleared, with no timeout. See the
//! device-specific data sheet for appropriate drive settings. NOTE: User must
//! call CS_setExternalClockSource to set frequency of external clocks before
//! calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param xt2drive is the target drive strength for the XT2 crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_XT2DRIVE_4MHZ_8MHZ
//!        - \b CS_XT2DRIVE_8MHZ_16MHZ
//!        - \b CS_XT2DRIVE_16MHZ_24MHZ
//!        - \b CS_XT2DRIVE_24MHZ_32MHZ [Default]
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG1 register.
//!
//! \return None
//
//*****************************************************************************
void CS_XT2Start (  uint16_t baseAddress,
    uint16_t xt2drive
    )
{
	assert(CS_XT2ClockFrequency !=0);

    assert((xt2drive == CS_XT2DRIVE_4MHZ_8MHZ  ) ||
    	   (xt2drive == CS_XT2DRIVE_8MHZ_16MHZ ) ||
           (xt2drive == CS_XT2DRIVE_16MHZ_24MHZ )||
           (xt2drive == CS_XT2DRIVE_24MHZ_32MHZ ));

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

