ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/deprecated/cs.c
    //Disable XT2BYPASS mode and Switch on XT2 oscillator
    HWREG16(baseAddress + OFS_CSCTL4) &= ~XT2BYPASS;

    while (HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG){
     //Clear OSC flaut Flags
     HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT2OFFG);

     //Clear OFIFG fault flag
     HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    HWREG16(baseAddress + OFS_CSCTL4) = ( HWREG16(baseAddress + OFS_CSCTL4) &
                                         ~(CS_XT2DRIVE_24MHZ_32MHZ)
                                         ) | (xt2drive);

    HWREG16(baseAddress + OFS_CSCTL4) &= ~XT2OFF;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Bypasses the XT2 crystal oscillator
//!
//! Bypasses the XT2 crystal oscillator which supports crystal frequencies
//! between 4 MHz and 32 MHz. Loops until all oscillator fault flags are
//! cleared, with no timeout. NOTE: User must call CS_setExternalClockSource to
//! set frequency of external clocks before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG register.
//!
//! \return None
//
//*****************************************************************************
void CS_bypassXT2 (  uint16_t baseAddress )
{
	//Verify user has initialized value of XT2Clock
	assert(CS_XT2ClockFrequency !=0);

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    //Switch off XT2 oscillator and set it to BYPASS mode
    HWREG16(baseAddress + OFS_CSCTL4) |= ( XT2BYPASS + XT2OFF );

	 while (HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG){
     //Clear OSC fault Flags
     HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT2OFFG);

     //Clear OFIFG fault flag
     HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes the XT2 crystal oscillator with timeout
//!
//! Initializes the XT2 crystal oscillator, which supports crystal frequencies
//! between 4 MHz and 32 MHz, depending on the selected drive strength. Loops
//! until all oscillator fault flags are cleared or until a timeout counter is
//! decremented and equals to zero. See the device-specific data sheet for
//! appropriate drive settings. NOTE: User must call CS_setExternalClockSource
//! to set frequency of external clocks before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param xt2drive is the target drive strength for the XT2 crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_XT2DRIVE_4MHZ_8MHZ
//!        - \b CS_XT2DRIVE_8MHZ_16MHZ
//!        - \b CS_XT2DRIVE_16MHZ_24MHZ
//!        - \b CS_XT2DRIVE_24MHZ_32MHZ [Default]
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_XT2StartWithTimeout ( uint16_t baseAddress,
    uint16_t xt2drive,
    uint32_t timeout
    )
{
	//Verify user has initialized value of XT2Clock
	assert(CS_XT2ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	// Disable XT2BYPASS mode
    HWREG16(baseAddress + OFS_CSCTL4) &= ~XT2BYPASS;

	while ((HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT2OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

	}

    if (timeout){
		//Set drive strength for XT2
	    HWREG16(baseAddress + OFS_CSCTL4) = ( HWREG16(baseAddress + OFS_CSCTL4) &
	                                         ~(CS_XT2DRIVE_24MHZ_32MHZ)
	                                         ) |
	                                       (xt2drive);

	    //Switch on XT2 oscillator
	    HWREG16(baseAddress + OFS_CSCTL4) &= ~XT2OFF;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

//*****************************************************************************
//
//! \brief Bypasses the XT2 crystal oscillator with timeout
//!
//! Bypasses the XT2 crystal oscillator with timeout, which supports crystal
//! frequencies between 4 MHz and 32 MHz. Loops until all oscillator fault
//! flags are cleared or until a timeout counter is decremented and equals to
//! zero. NOTE: User must call CS_setExternalClockSource to set frequency of
//! external clocks before calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_bypassXT2WithTimeout ( uint16_t baseAddress,
    uint32_t timeout
    )
{
	//Verify user has initialized value of XT2Clock
	assert(CS_XT2ClockFrequency !=0);

    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	//Switch off XT2 oscillator and enable BYPASS mode
    HWREG16(baseAddress + OFS_CSCTL4) |= (XT2BYPASS + XT2OFF );

	while ((HWREG8(baseAddress + OFS_CSCTL5) & XT2OFFG) && --timeout)
	{
		//Clear OSC fault Flags fault flags
		HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT2OFFG);

		// Clear the global fault flag. In case the XT1 caused the global fault
		// flag to get set this will clear the global error condition. If any
		// error condition persists, global flag will get again.
		HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

