ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/deprecated/cs.c
	}

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

    if (timeout){
        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

//*****************************************************************************
//
//! \brief Stops the XT2 oscillator using the XT2OFF bit.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL4 register.
//!
//! \return None
//
//*****************************************************************************
void CS_XT2Off (uint16_t baseAddress)
{

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    //Switch off XT2 oscillator
    HWREG16(baseAddress + OFS_CSCTL4) |= XT2OFF;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables conditional module requests
//!
//! \param baseAddress is the base address of the CS module.
//! \param selectClock selects specific request enables.
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//!
//! Modified bits of \b CSCTL6 register.
//!
//! \return None
//
//*****************************************************************************
void CS_enableClockRequest (uint16_t baseAddress,
    uint8_t selectClock
    )
{
	assert(
			(CS_ACLK  == selectClock )||
			(CS_SMCLK == selectClock )||
			(CS_MCLK  == selectClock )||
			(CS_MODOSC== selectClock ));

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    HWREG8(baseAddress + OFS_CSCTL6) |= selectClock;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables conditional module requests
//!
//! \param baseAddress is the base address of the CS module.
//! \param selectClock selects specific request enables.
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//!
//! Modified bits of \b CSCTL6 register.
//!
//! \return None
//
//*****************************************************************************
void CS_disableClockRequest (uint16_t baseAddress,
    uint8_t selectClock
    )
{
	assert(
			(CS_ACLK  == selectClock )||
			(CS_SMCLK == selectClock )||
			(CS_MCLK  == selectClock )||
			(CS_MODOSC== selectClock ));

 	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    HWREG8(baseAddress + OFS_CSCTL6) &= ~selectClock;

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Gets the current CS fault flag status.
//!
//! \param baseAddress is the base address of the CS module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b CS_XT2OFFG - XT2 oscillator fault flag
//!        - \b CS_XT1OFFG - XT2 oscillator fault flag (HF mode)
//!
//! \return Logical OR of any of the following:
//!         - \b CS_XT2OFFG XT2 oscillator fault flag
//!         - \b CS_XT1OFFG XT2 oscillator fault flag (HF mode)
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
uint8_t CS_faultFlagStatus (uint16_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= CS_XT2OFFG );
    return (HWREG8(baseAddress + OFS_CSCTL5) & mask);
}

//*****************************************************************************
//
//! \brief Clears the current CS fault flag status for the masked bit.
//!
//! \param baseAddress is the base address of the CS module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b CS_XT2OFFG - XT2 oscillator fault flag
//!        - \b CS_XT1OFFG - XT2 oscillator fault flag (HF mode)
//!
//! Modified bits of \b CSCTL5 register.
//!
//! \return None
//
//*****************************************************************************
void CS_clearFaultFlag (uint16_t baseAddress,
    uint8_t mask
    )
{
    assert(mask <= CS_XT2OFFG );

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    HWREG8(baseAddress + OFS_CSCTL5) &= ~mask;

	// Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Get the current ACLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case XT1 or XT2 is
//! being used.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! \return Current ACLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getACLK (uint16_t baseAddress)
{
	//Find ACLK source
	uint16_t ACLKSource = (HWREG16(baseAddress + OFS_CSCTL2) & SELA_7);
	ACLKSource = ACLKSource >> 8;

	//Find ACLK frequency divider
	uint16_t ACLKSourceDivider =  HWREG16(baseAddress + OFS_CSCTL3) & SELA_7;
	ACLKSourceDivider = ACLKSourceDivider >>8;

	return (privateCSComputeCLKFrequency(baseAddress,
					ACLKSource,
					ACLKSourceDivider));
}

//*****************************************************************************
//
//! \brief Get the current SMCLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case XT1 or XT2 is
//! being used.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! \return Current SMCLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getSMCLK (uint16_t baseAddress)
{
	//Find SMCLK source
	uint16_t SMCLKSource = HWREG8(baseAddress + OFS_CSCTL2) & SELS_7 ;

	SMCLKSource = SMCLKSource >> 4;

	//Find SMCLK frequency divider
	uint16_t SMCLKSourceDivider = HWREG16(baseAddress + OFS_CSCTL3) & SELS_7;
	SMCLKSourceDivider = SMCLKSourceDivider >> 4;

	return (privateCSComputeCLKFrequency(baseAddress,
				SMCLKSource,
				SMCLKSourceDivider )
			);
}

//*****************************************************************************
//
//! \brief Get the current MCLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case XT1 or XT2 is
//! being used.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! \return Current MCLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getMCLK (uint16_t baseAddress)
{

	//Find MCLK source
	uint16_t MCLKSource = (HWREG16(baseAddress + OFS_CSCTL2) & SELM_7);
	//Find MCLK frequency divider
	uint16_t MCLKSourceDivider =  HWREG16(baseAddress + OFS_CSCTL3) & SELM_7;

	return (privateCSComputeCLKFrequency(baseAddress,
				MCLKSource,
				MCLKSourceDivider )
			);
}

//*****************************************************************************
//
//! \brief Clears all the Oscillator Flags
//!
//! \param baseAddress is the base address of the CS module.
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register and bits of \b SFRIFG1 register.
//!
//! \return the mask of the oscillator flag status
//
//*****************************************************************************
uint16_t CS_clearAllOscFlagsWithTimeout(uint16_t baseAddress,
                                             uint32_t timeout
                                             )
{
    assert(timeout > 0);

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    do {

      // Clear all osc fault flags
      HWREG8(baseAddress + OFS_CSCTL5) &= ~(XT1OFFG + XT2OFFG );

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

    // Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

    return (HWREG8(baseAddress + OFS_CSCTL5) & (XT1OFFG + XT2OFFG));
}

//*****************************************************************************
//
//! \brief Set DCO frequency
//!
//! \param baseAddress is the base address of the CS module.
//! \param dcorsel selects frequency range option. Valid options are:
//!        CS_DCORSEL_0 [Default] CS_DCORSEL_1
//!        Valid values are:
//!        - \b CS_DCORSEL_0
//!        - \b CS_DCORSEL_1
//! \param dcofsel selects valid frequency options based on dco frequency range
//!        selection (dcorsel).
//!        Valid values are:
//!        - \b CS_DCOFSEL_0 - Low frequency option 5.33MHZ. High frequency
//!           option 16MHz.
//!        - \b CS_DCOFSEL_1 - Low frequency option 6.67MHZ. High frequency
//!           option 20MHz.
//!        - \b CS_DCOFSEL_2 - Low frequency option 5.33MHZ. High frequency
//!           option 16MHz.
//!        - \b CS_DCOFSEL_3 [Default] - Low frequency option 8MHZ. High
//!           frequency option 24MHz.
//!
//! \return None
//
//*****************************************************************************
void CS_setDCOFreq(uint16_t baseAddress,
		uint16_t dcorsel,
		uint16_t dcofsel)
{

	//Verify User has selected a valid frequency option
	assert(
			(dcofsel==CS_DCOFSEL_0)||
			(dcofsel==CS_DCOFSEL_1)||
			(dcofsel==CS_DCOFSEL_2)||
			(dcofsel==CS_DCOFSEL_3));
	//Verify User has selected a valid frequency option

	//Verify user has selected a valid DCO Frequency Range option
	assert(
			(dcorsel==CS_DCORSEL_0)||
			(dcorsel==CS_DCORSEL_1));

	//Unlock CS control register
	HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

	// Set user's frequency selection for DCO
	HWREG16(baseAddress + OFS_CSCTL1) = (dcorsel + dcofsel);

	// Lock CS control register
	HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

#endif
#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
